#ifndef __FATFS_TEST_H__
#define __FATFS_TEST_H__

/*
*************************************************************************
*                             包含的头文件
*************************************************************************
*/


/* 开发板硬件bsp头文件 */
#include "stm32f4xx.h"
#include "led/bsp_led.h" 
#include "usart/bsp_debug_usart.h"
#include "ff.h"



/*
*************************************************************************
*                             变量声明
*************************************************************************
*/

extern FATFS fs;													/* FatFs文件系统对象 */
//FIL fnew;													/* 文件对象 */
extern FRESULT res_sd;                /* 文件操作结果 */
//UINT fnum;            					  /* 文件成功读写数量 */
//BYTE ReadBuffer[1024];        /* 读缓冲区 */
//extern BYTE WriteBuffer; 

/*
*************************************************************************
*                               函数声明
*************************************************************************
*/

void FileSystem_Init(void);

void FileSystem_Test(void);




#endif /* __FATFS_TEST_H__ */





