/**
  ******************************************************************************
  * @file    main.c
  * @author  fire
  * @version V1.0
  * @date    2015-xx-xx
  * @brief   SD卡文件系统例程
  ******************************************************************************
  * @attention
  *
  * 实验平台:秉火  STM32 F429 开发板 
  * 论坛    :http://www.firebbs.cn
  * 淘宝    :http://firestm32.taobao.com
  *
  ******************************************************************************
  */
/**
  ******************************************************************************
  *                              头文件
  ******************************************************************************
  */
	
#include "board.h"
#include "rtthread.h"	


/**
  ******************************************************************************
  *                              定义变量
  ******************************************************************************
  */

/**
  ******************************************************************************
  *                                任务函数
  ******************************************************************************
  */
	
	/* 定义线程控制块 */
static rt_thread_t test_thread = RT_NULL;
/*
*************************************************************************
*                             函数声明
*************************************************************************
*/
static void test_thread_entry(void* parameter);
	


/**
  * @brief  主函数
  * @param  无
  * @retval 无
  */
int main(void)
{
	rt_kprintf("这是一个[野火]-STM32F429挑战者RTT文件系统实验！\n\n");
	
	test_thread =                          /* 线程控制块指针 */
	rt_thread_create( "test",              /* 线程名字 */
										test_thread_entry,   /* 线程入口函数 */
										RT_NULL,             /* 线程入口函数参数 */
										2048,                 /* 线程栈大小 */
										3,                   /* 线程的优先级 */
										20);                 /* 线程时间片 */
								 
	/* 启动线程，开启调度 */
 if (test_thread != RT_NULL)
			rt_thread_startup(test_thread);
	else
			return -1;
}

static void test_thread_entry(void* parameter)
{	
	/* 文件系统初始化 */
	FileSystem_Init();
	while (1)
	{
		/* 文件系统读写测试 */
		FileSystem_Test();

		LED2_TOGGLE;
		rt_thread_delay(1000);   /* 延时1000个tick */		 		

	}
}




/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
